In [ ]:
import pandas as pd

    # Series

In [2]:
nums = [3,4,5,6,7]
serie = pd.Series(nums)
serie, type(serie)

(0    3
 1    4
 2    5
 3    6
 4    7
 dtype: int64,
 pandas.core.series.Series)

data = {
    'Nombre':['Ana', 'Juan', 'Pedro', 'Maria', 'Luis'],
    'Edad':[22,25,28,23,20],
    'Ciudad':['Barcelona','Madrid','Valencia','Sevilla','Bilboa']
}
data, type(data)

# Generar in dataframe a partir de un diccionario

In [7]:
df = pd.DataFrame(data=data)
df

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona
1   Juan    25     Madrid
2  Pedro    28   Valencia
3  Maria    23    Sevilla
4   Luis    20     Bilboa

# Exportar DataFrame

In [8]:
df.to_csv('data.csv')

# Importar un DataFrame
index_col = 0 indica que la primera columna será el índice

In [12]:
imp_df = pd.read_csv('data.csv', index_col=0) 
imp_df

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona
1   Juan    25     Madrid
2  Pedro    28   Valencia
3  Maria    23    Sevilla
4   Luis    20     Bilboa

# Seleccionar una columna

In [14]:
nombres = df['Nombre']
print(nombres, type(nombres))

0      Ana
1     Juan
2    Pedro
3    Maria
4     Luis
Name: Nombre, dtype: object <class 'pandas.core.series.Series'>

   # Seleccionar varias columnas

In [42]:
df[['Nombre','Edad']]

  Nombre  Edad
0    Ana    22
1   Juan    25
2  Pedro    28
3  Maria    23
4   Luis    20

# Filtrar por indice

In [46]:
fila = df.loc[2]
fila

Nombre       Pedro
Edad            28
Ciudad    Valencia
Name: 2, dtype: object

# Filtrar por condicion

In [47]:
df[df['Edad']>23]

  Nombre  Edad    Ciudad
1   Juan    25    Madrid
2  Pedro    28  Valencia

In [49]:
filtro = (df['Edad']>23) & (df['Nombre'].str.startswith('P'))
df[filtro]

  Nombre  Edad    Ciudad
2  Pedro    28  Valencia

# Filtrar por query

In [57]:
df.query("Edad < 23")

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona
4   Luis    20     Bilboa

In [59]:
df[df['Nombre'].isin(['Ana', 'Carlos', 'Luis'])]

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona
4   Luis    20     Bilboa

In [60]:
def longitud_5(nombre):
    return len(nombre) == 5

df[df['Nombre'].apply(longitud_5)]

  Nombre  Edad    Ciudad
2  Pedro    28  Valencia
3  Maria    23   Sevilla

# Filtrar por rangos

In [61]:
df[df['Edad'].between(25,35)]

  Nombre  Edad    Ciudad
1   Juan    25    Madrid
2  Pedro    28  Valencia

In [63]:
df1 = pd.DataFrame({
    'categoria': ['A', 'A', 'B', 'B', 'B', 'C', 'C', 'C', 'C'],
    'valor': [10, 20, 30, 40, 50,5,15,25,35]
})

# Agrupa los datos por categoría y calcula la suma, el promedio y la cantidad de elementos
agregado = df1.groupby('categoria').agg({'valor': ['size']})

print(agregado)

          valor
           size
categoria
A             2
B             3
C             4

In [3]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'Nombre':['Ana', 'Juan', 'Pedro', 'Maria', 'Luis'],
    'Edad':[22,25,np.nan,23,20],
    'Ciudad':['Barcelona','Madrid','Valencia',None,'Bilboa']
}
df = pd.DataFrame(data)
df.fillna

  Nombre  Edad     Ciudad
0    Ana  22.0  Barcelona
1   Juan  25.0     Madrid
2  Pedro   NaN   Valencia
3  Maria  23.0       None
4   Luis  20.0     Bilboa

In [4]:
# Rellenar los valores faltantes
df_fill = df.fillna(
    {
        "Edad" : df["Edad"].mean(),
        "Ciudad": "Desconocido"
    }
)
df_fill

  Nombre  Edad       Ciudad
0    Ana  22.0    Barcelona
1   Juan  25.0       Madrid
2  Pedro  22.5     Valencia
3  Maria  23.0  Desconocido
4   Luis  20.0       Bilboa

In [5]:
df_sin_nan = df.dropna()
df_sin_nan

  Nombre  Edad     Ciudad
0    Ana  22.0  Barcelona
1   Juan  25.0     Madrid
4   Luis  20.0     Bilboa

In [7]:
# Reemplazar valores especificos de alguna columna
df_reem = df.replace(
    {
        "Ciudad" : {None:"Desconocido"}
    }
)
df_reem

  Nombre  Edad       Ciudad
0    Ana  22.0    Barcelona
1   Juan  25.0       Madrid
2  Pedro   NaN     Valencia
3  Maria  23.0  Desconocido
4   Luis  20.0       Bilboa

In [8]:
# Interpolar valores
df_interpolado = df.copy()
df_interpolado['Edad'] = df['Edad'].interpolate()
df_interpolado

  Nombre  Edad     Ciudad
0    Ana  22.0  Barcelona
1   Juan  25.0     Madrid
2  Pedro  24.0   Valencia
3  Maria  23.0       None
4   Luis  20.0     Bilboa

In [11]:
data_duplicada = {
    'Nombre':['Ana', 'Juan', 'Pedro', 'Maria', 'Luis','Ana','Juan'],
    'Edad':[22,25,np.nan,23,20,22,25],
    'Ciudad':['Barcelona','Madrid','Valencia',None,'Bilboa','Barcelona','Madrid']
}
df_duplicado = pd.DataFrame(data_duplicada)
df_duplicado

  Nombre  Edad     Ciudad
0    Ana  22.0  Barcelona
1   Juan  25.0     Madrid
2  Pedro   NaN   Valencia
3  Maria  23.0       None
4   Luis  20.0     Bilboa
5    Ana  22.0  Barcelona
6   Juan  25.0     Madrid

In [12]:
df_sin_duplicados = df_duplicado.drop_duplicates()
df_sin_duplicados

  Nombre  Edad     Ciudad
0    Ana  22.0  Barcelona
1   Juan  25.0     Madrid
2  Pedro   NaN   Valencia
3  Maria  23.0       None
4   Luis  20.0     Bilboa

In [13]:
# Renombrar columnas
df_renombrar=df.rename(columns={"Nombre":"Name","Edad":"Age","Ciudad":"City"})
df_renombrar

    Name   Age       City
0    Ana  22.0  Barcelona
1   Juan  25.0     Madrid
2  Pedro   NaN   Valencia
3  Maria  23.0       None
4   Luis  20.0     Bilboa

In [14]:
# ordenar columnas
cols_orden = ['Ciudad', 'Edad', 'Nombre']
df_ordenado = df[cols_orden]
df_ordenado

      Ciudad  Edad Nombre
0  Barcelona  22.0    Ana
1     Madrid  25.0   Juan
2   Valencia   NaN  Pedro
3       None  23.0  Maria
4     Bilboa  20.0   Luis

In [19]:
# Transformacion de datos
def cuadrado(x):
    return x**2

df["Edad_cuadrado"] = df["Edad"].apply(cuadrado)
df

  Nombre  Edad     Ciudad  Edad_cuadrado
0    Ana  22.0  Barcelona          484.0
1   Juan  25.0     Madrid          625.0
2  Pedro   NaN   Valencia            NaN
3  Maria  23.0       None          529.0
4   Luis  20.0     Bilboa          400.0

In [6]:
# Agregacion de datos
data = {
    'Nombre':['Juan', 'Ana', 'Luis', 'Laura', 'Pedro', 'Carla'],
    'Ciudad':['Madrid','Barcelona','Madrid','Valencia','Barcelona','Madrid'],
    'Edad':[25,33,30,28,45,38],
    'Puntuacion':[80,90,85,88,75,91]
}
df = pd.DataFrame(data)
df

  Nombre     Ciudad  Edad  Puntuacion
0   Juan     Madrid    25          80
1    Ana  Barcelona    33          90
2   Luis     Madrid    30          85
3  Laura   Valencia    28          88
4  Pedro  Barcelona    45          75
5  Carla     Madrid    38          91

In [5]:
# Agrupar los datos por ciudad
grouped = df.groupby('Ciudad')
print(grouped.groups)

{'Barcelona': [1, 4], 'Madrid': [0, 2, 5], 'Valencia': [3]}

In [7]:
# Calcular la suma de las edades y puntuaciones por ciudad
aggregated_data = grouped.agg(
    {
        'Edad':'mean',
        'Puntuacion':'sum',
        'Ciudad':'size'
    })
aggregated_data

           Edad  Puntuacion  Ciudad
Ciudad
Barcelona  39.0         165       2
Madrid     31.0         256       3
Valencia   28.0          88       1

In [8]:
# Definir una funcion de agregacion personalizado
def rango(series):
    return series.max() - series.min()

# Aplicar la funcion agg por el grupo
aggregated_data_custom = grouped.agg(
    {
        'Edad':rango,
        'Puntuacion':rango
    }
)
aggregated_data_custom

           Edad  Puntuacion
Ciudad
Barcelona    12          15
Madrid       13          11
Valencia      0           0

In [11]:
# Calcular la suma de las edades y la ciudad
#data['Categoria'] = ['A', 'B', 'A', 'B', 'A', 'B']
df = pd.DataFrame(data)
df

  Nombre     Ciudad  Edad  Puntuacion Categoria
0   Juan     Madrid    25          80         A
1    Ana  Barcelona    33          90         B
2   Luis     Madrid    30          85         A
3  Laura   Valencia    28          88         B
4  Pedro  Barcelona    45          75         A
5  Carla     Madrid    38          91         B

In [19]:
# Agregar datos por ciudad y categoria
grouped_multi = df.groupby(['Ciudad', 'Categoria'])
grouped_multi.groups

{('Barcelona', 'A'): [4], ('Barcelona', 'B'): [1], ('Madrid', 'A'): [0, 2], ('Madrid', 'B'): [5], ('Valencia', 'B'): [3]}

In [22]:
# Calcular la suma de las edades y puntuacion por ciudad y por categoria
grouped_data_multi = grouped_multi.agg(
    {
        'Edad':'sum',
        'Puntuacion':'mean'
    }
)
grouped_data_multi

                     Edad  Puntuacion
Ciudad    Categoria
Barcelona A            45        75.0
          B            33        90.0
Madrid    A            55        82.5
          B            38        91.0
Valencia  B            28        88.0

In [29]:
data = {'Nombre':['Juan','Ana','Luis','Laura'],
        'Edad':[25,33,30,28]
       }
df = pd.DataFrame(data)
df

  Nombre  Edad
0   Juan    25
1    Ana    33
2   Luis    30
3  Laura    28

In [30]:
df['Ciudad'] = ['Madrid','Barceloa','Madrid','Valencia']
df

  Nombre  Edad    Ciudad
0   Juan    25    Madrid
1    Ana    33  Barceloa
2   Luis    30    Madrid
3  Laura    28  Valencia

In [31]:
# Generar una nueva fila
nueva_fila = pd.Series({'Nombre':'Pedro','Edad':45,'Ciudad':'Barcelona'})

# Agregar la nueva fila al DataFrame 
#.to_frame().T inserta como sila, sin .T insertará como columna
# ignore_index=True generá automáticamente la numeración del índice, si fuese False el index sería 0 cero
df = pd.concat([df, nueva_fila.to_frame().T], ignore_index=True)
df

  Nombre Edad     Ciudad
0   Juan   25     Madrid
1    Ana   33   Barceloa
2   Luis   30     Madrid
3  Laura   28   Valencia
4  Pedro   45  Barcelona

# Combinar DataFrames

In [43]:
# Crear 1er DataFrane
data = {'Nombre':['Juan','Ana','Luis','Laura'],
        'Edad':[25,33,30,28],
        'Ciudad': ['Madrid','Barceloa','Madrid','Valencia']
       }
df1 = pd.DataFrame(data)

# Crear 2do DataFrame
data2 = {'Nombre':['Carla','Irene'],
        'Edad':[38,27],
        'Ciudad':['Madrid','Bilbao']
       }
df2 = pd.DataFrame(data2)

In [44]:
df1

  Nombre  Edad    Ciudad
0   Juan    25    Madrid
1    Ana    33  Barceloa
2   Luis    30    Madrid
3  Laura    28  Valencia

In [35]:
df1

  Nombre  Edad
0   Juan    25
1    Ana    33
2   Luis    30
3  Laura    28

In [36]:
df2

  Nombre  Edad  Ciudad
0  Carla    38  Madrid
1  Irene    27  Bilbao

In [45]:
df_combinado = pd.concat([df1,df2], ignore_index=True)
df_combinado

  Nombre  Edad    Ciudad
0   Juan    25    Madrid
1    Ana    33  Barceloa
2   Luis    30    Madrid
3  Laura    28  Valencia
4  Carla    38    Madrid
5  Irene    27    Bilbao

In [1]:
# importing pandas as pd
import pandas as pd
  
# Creating the dataframe 
df = pd.DataFrame({"A":["sofia", 5, 8, 11, 100],
                   "B":[2, 8, 77, 4, 11],
                   "C":["amy", 11, 4, 6, 9]})
  
# Print the dataframe
df

       A   B    C
0  sofia   2  amy
1      5   8   11
2      8  77    4
3     11   4    6
4    100  11    9

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      object
 1   B       5 non-null      int64
 2   C       5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [3]:
# slice from the 1st row till end
df_new = df[1:]

In [5]:
df_new

     A   B   C
1    5   8  11
2    8  77   4
3   11   4   6
4  100  11   9

In [4]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 1 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      object
 1   B       4 non-null      int64
 2   C       4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [6]:
# applying infer_objects() function.
df_new = df_new.infer_objects()

# Print the dtype after applying the function
df_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 1 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 228.0 bytes

In [7]:
# importing pandas as pd
import pandas as pd

# Creating the dataframe
df = pd.DataFrame({"A":["sofia", 5, 8, 11, 100],
				"B":[2 + 2j, 8, 77, 4, 11],
				"C":["amy", 11, 4, 6, 9]})

# Print the dataframe
df

       A          B    C
0  sofia   2.0+2.0j  amy
1      5   8.0+0.0j   11
2      8  77.0+0.0j    4
3     11   4.0+0.0j    6
4    100  11.0+0.0j    9

In [8]:
# to print the basic info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      object
 1   B       5 non-null      complex128
 2   C       5 non-null      object
dtypes: complex128(1), object(2)
memory usage: 288.0+ bytes

In [9]:
# slice from the 1st row till end
df_new = df[1:]

# Let's print the new data frame
df_new

# Now let's print the data type of the columns
df_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 1 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      object
 1   B       4 non-null      complex128
 2   C       4 non-null      object
dtypes: complex128(1), object(2)
memory usage: 260.0+ bytes

In [10]:
# applying infer_objects() function.
df_new = df_new.infer_objects()

# Print the dtype after applying the function
df_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 1 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      complex128
 2   C       4 non-null      int64
dtypes: complex128(1), int64(2)
memory usage: 260.0 bytes